<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>读者规则</title>
<link rel="stylesheet" type="text/css" href="css/styles.css">
</head>
<body>
<%
	String str = (String)session.getAttribute("user");
	String type = (String)session.getAttribute("type");
	if(str == null || type != "reader") {
		response.sendRedirect("reader-login.jsp");
		return;
	}
%>
<header>
	<ul>
		<li><a href="booksearch.jsp">图书查询</a></li>
		<li><a href="reader-login.jsp">读者信息</a></li>
		<li><a href="lendhistory.jsp">借阅历史</a></li>
		<li><a href="error.jsp">违章信息</a></li>
		<li><a href="rules.jsp">读者规则</a></li>
		<li><a href="admin-login.jsp">管理员界面</a>
	</ul>
	<h1><a href="index.jsp">图书管理系统</a></h1>
	<p><%
		if(str==null||type!="reader"){
			out.print("未登录");
		}else {
			out.print("<a href='logout.jsp'>读者"+str+"</a>");
		};
	%></p>
</header>
<p>
公司的图书管理涉及图书信息、系统用户信息、读者信息、图书借阅等多种数据管理。从管理的角度可将图书分为三类：图书信息管理、系统用户管理、读者数据管理。图书信息管理包括图书征定、借还、查询等操作，系统用户管理包括系统用户类别和用户数据管理，读者数据管理包括读者类别管理和个人数据的录入、修改和删除。
图书借阅者的需求是查询图书室所存的图书、个人借阅情况及个人信息的修改；图书馆工作人员对图书借阅者的借阅及还书要求进行操作，同时形成借书或还书报表给借阅者查看确认；图书馆管理人员的功能最为复杂，包括对工作人员、图书借阅者、图书进行管理和维护，及系统状态的查看、维护等。图书借阅者可直接查看图书馆图书情况，如果图书借阅者根据本人借书证号和密码登录系统，还可以进行本人借书情况的查询和维护部分个人信息。一般情况下，图书借阅者只应该查询和维护本人的借书情况和个人信息，若查询和维护其他借阅者的借书情况和个人信息，就要知道其他图书借阅者的借书证号和密码。这些是很难得到的，特别是密码，所以不但满足了图书借阅者的要求，还保护了图书借阅者的个人隐私。图书馆工作人员有修改图书借阅者借书和还书记录的权限，所以需对工作人员登陆本模块进行更多的考虑。在此模块中，图书馆工作人员可以为图书借阅者加入借书记录或是还书记录，并打印生成相应的报表给用户查看和确认。图书馆管理人员功能的信息量大，数据安全性和保密性要求最高。本功能实现对图书信息、借阅者信息、总体借阅情况信息的管理和统计、工作人员和管理人员信息查看及维护。图书馆管理员可以浏览、查询、添加、删除、修改、统计图书的基本信息；浏览、查询、统计、添加、删除和修改图书借阅者的基本信息，浏览、查询、统计图书馆的借阅信息，但不能添加、删除和修改借阅信息，这部分功能应该由图书馆工作人员执行，但是，删除某条图书借阅者基本信息记录时，应实现对该图书借阅者借阅记录的级联删除。并且还应具有生成催还图书报表，并打印输出的功能。
二 系统的功能需求	
在本系统中，对读者来说，他们关心的问题其实是如何方便的查询到图书馆中的书籍以及自己正在借阅或是已经借阅过些什么书，所借的书是否到期等。[3]由此可以得出系统在面向读者方面应该至少做到如下几点：
1．图书查询。
2．读者信息查询，读者信息的查询内容应包括下面的几个方面：
读者信息——对读者的基本信息进行显示。
书刊借阅——对该读者借阅过的所有书籍进行查询。
借阅历史——查询该读者借阅过的所有书籍。
违章信息——该读者的违章信息。
读者规则——该读者所应用的规则。
对系统的管理员来说，应该注意的是：
1．图书馆中有些什么书，它们都存放在那里，是不是可以被借阅；
2．本图书馆发放的读者证有那些，如何管理这些读者证；
3．这些读者证都借阅着那些书；
4．如何来确定这些读者证是否可用，以及借书的还期等。
从以上问题出发，可以得出本系统应该具有的功能：
1．图书查询——对馆内的图书进行查询。
2．借阅管理——对读者的每一次借阅，还书进进登记和管理。
3．图书管理——对图书馆的书籍进行管理。
4．借阅证管理——对读者的借阅证进行管理。
5．读者规则管理——设置和管理读者规则。
</p>
</body>
</html>